app/views/contacts/show.html.erb

SELECT "phones".* FROM "phones" WHERE "phones"."contact_id" = $1  [["contact_id", 7]]
---
<ul>
  <% @contact.phones.each do |phone| %>