app/controllers/contacts_controller.rb

  def create
  	@contact = Contact.new(:name => params[:name],
                              :email => params[:email],
                              :phone => params[:phone])
    #note this is equivalent to:
    #  @contact = Contact.new(params)

    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "phone") VALUES ($1, $2, $3) RETURNING "id"  [["name", "John"], ["email", "john@example.com"], ["phone", "1234566"]]

  def show
    @contact = Contact.find(params[:id]) #ie, the contact when this action occurs is the Contact matching the id that was entered (correponding to the ":id" in the route)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 2]]

  def update
    @contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 5]]

 def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 6]]