app/controllers/phones_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 4]]
---
  def new
    contact = Contact.find(params[:contact_id])

INSERT INTO "phones" ("number", "contact_id") VALUES ($1, $2) RETURNING "id"  [["number", "87654321"], ["contact_id", 4]]
---
  def create
    @phone = Phone.new(:number => params[:number],
                       :contact_id => params[:contact_id])
    if @phone.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 7]]
SELECT  "phones".* FROM "phones" WHERE "phones"."id" = $1 LIMIT 1  [["id", 7]]
---
 def edit
    @contact = Contact.find(params[:contact_id])
    @phone = Phone.find(params[:phone_id])

SELECT  "phones".* FROM "phones" WHERE "phones"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "phones" SET "number" = $1 WHERE "phones"."id" = $2  [["number", "87654321a"], ["id", 2]]
---
  def update
    @phone = Phone.find(params[:phone_id])
    if @phone.update(:number => params[:number])